package basicsJava;

public class Sound {
    /** Упражнение 2.1. Вычисление расстояния до вспышки молнии
     * стр. 71.
     * Вычислите расстояние до места вспышки молнии, звук от которого
     * доходит до наблюдателя через 7.2 секунды.
     */
    public static void main(String[] args) {
        double dist;
        dist = 1100 * 7.2;
        System.out.println("Расстояние до места вспышки молнии " + "состовляет " + dist + " футов.");
    }
}
